
const headH1 = document.querySelector('h1');
const btn = document.querySelector('.btn');
const img = document.querySelectorAll('.img-end');
const startSection = document.querySelector('.start');
const categoriesSection = document.querySelector('.categories');
const playSection = document.querySelector('.section-play');
const controlPlay = document.querySelector('.control-play');
const againBtn = controlPlay.firstElementChild;
const categoriesBtn = controlPlay.lastElementChild;
const categoriesLinks = document.querySelector('.categories-links');
const Letters = document.querySelector('.abc');
const currentWord = document.querySelector('.play-heading');
const AllImage = document.querySelector('.play-tabel').querySelectorAll('img');

// Массивы категорий

const categories = {
    наука: ["физика", "химия", "прогресс", "исследование", "биология", "учёный", "математика", "открытие",
        "астрономия", "философия", "изучение", "гранит", "знание", "эксперимент", "психология", "учёные", "теория", "познание", "жизнь",
        "техника", "искусство", "профессор", "урок", "исследования", "знания", "логика", "учебник", "интеллект", "свет", "изобретение",
        "микроскоп", "институт", "история", "религия", "природа", "гипотеза", "ломоносов", "лаборатория", "мозг", "лингвистика", "университет",
        "формула", "академия", "космос", "развитие", "кибернетика", "учёба", "опыт", "учение", "секс", "доктор", "фантастика", "менделеев", "мудрость",
        "ньютон", "спорт", "технология", "академик", "точность", "атеизм", "кандидат", "степень", "технологии", "литература", "школа", "опыты", "естествознание",
        "мышление", "атом", "открытия", "генетика", "астрофизика", "нии", "эйнштейн", "эзотерика", "география", "дисциплина", "геометрия", "образование", "анатомия",
        "ум", "диссертация", "термин", "методология", "медицина", "лженаука", "физиология", "метрология", "геология", "будущее", "обсерватория", "филология", "астрология",
        "галилей", "практика", "теорема", "просветление", "бионика", "магия", "магистр", "механика", "логос", "алхимия", "биохимия", "академгородок", "метод", "сфера", "юноша",
        "миропонимание", "журнал", "просвещение", "наукоград", "парадигма", "материаловедение", "соционика", "конференция", "измерение", "нанотехнологии", "лауреат", "истина", "вера",
        "таблица", "менделеева", "достижение", "эксперименты", "молекула", "прорыв", "статья", "мир", "издательство", "предмет", "нейробиология", "мука", "гений", "обман", "псевдонаука",
        "антропология", "рационализм", "вселенная", "европа", "структура", "психолингвистика", "британские", "ученые", "производство", "правда", "мысль", "хокинг", "мичурин", "звёзды",
        "логичность", "раздел", "гипербола", "квантовая", "физика", "факты", "ссср", "основа", "бесконечность", "современность", "геополитика", "журналы", "ясность", "понимание",
        "воспитание", "умы", "уроки", "броуновское", "движение", "алгебра", "ботаника", "светила", "социология", "нумерология", "светило", "арифметика", "палеонтология", "сила",
        "книга", "архимед", "исследователь", "зоология", "экономика", "генеалогия", "сопромат", "обучение", "премия", "достоверность", "топология", "колба", "храм", "робототехника",
        "психиатрия", "тесла", "логистика", "этика", "победа", "урология", "семиотика", "сложность", "движение", "статистика", "экология", "пифагор", "очки", "футурология",
        "тригонометрия", "кинетика", "аэродинамика", "факт", "пробирка", "культура", "семантика", "типология", "коллайдер", "разум", "продвижение", "корпускулы", "подход",
        "любомудрие", "способ", "фундамент", "спелеология", "спирт", "аристотель", "научная", "фантастика", "химик", "молекулярная", "связь", "природоведение", "языкознание",
        "общество", "мифология", "археология", "понятие", "сознание", "система", "болтология", "вернадский", "формулы", "информатика", "кинематика", "хомо", "сапиенс", "скука",
        "колористика", "антропометрия", "нобель", "капица", "материя", "прибор", "птолемей", "мгу", "пример", "учитель", "эстетика", "вымысел", "фотосфера", "нумизматика",
        "онтология", "кафедра", "непознанное", "задача", "грант", "заблуждение", "область", "революция", "метафизика", "евгеника", "пенициллин", "бедность", "достижения",
        "лобачевский", "эклиптика", "учёность", "популяризация", "сейсмология", "физик", "гуманизм", "доказательство", "навык", "вектор"],
    смерть: ["жизнь", "коса", "рождение", "конец", "могила", "страх", "гроб", "покой", "горе", "труп", "сон", "вечность", "боль", "потеря", "кладбище", "похороны", "кончина", "траур", "тоска",
        "старуха", "ад", "прах", "бессмертие", "гибель", "утрата", "скорбь", "тьма", "война", "бесконечность", "скелет", "убийство", "морг", "время", "череп", "любовь", "судьба", "старость",
        "болезнь", "крест", "страдание", "печаль", "забвение", "тлен", "пустота", "панихида", "слёзы", "тишина", "спокойствие", "зло", "смерч", "дух", "холод", "суицид", "душа", "небытие", "рай",
        "яд", "бог", "радость", "разложение", "скорость", "счастье", "человек", "беда", "ужас", "упокоение", "ночь", "грусть", "возрождение", "удушье", "мир", "отпевание", "месть", "звезда", "авария",
        "самоубийство", "финиш", "жнец", "безысходность", "реанимация", "мертвец", "некролог", "поэт", "трагедия", "чума", "катастрофа", "завершение", "ангел", "закат", "казнь", "агония", "рак",
        "внезапность", "кости", "голод", "мор", "уход", "переход", "оружие", "выстрел", "неизбежность", "свобода", "водка", "выход", "наркотики", "игра", "спид", "наказание", "соль", "земля", "воскрешение",
        "темнота", "курение", "скука", "тетрадь", "кощей", "пушкин", "убийца", "окончание", "зависимость", "падение", "исход", "здоровье", "погибель", "гниение", "свет", "будущее", "слабость", "осень",
        "петля", "одиночество", "удар", "избавление", "вирус", "часы", "теракт"],
    космос: ["вселенная", "звёзды", "звезда", "гагарин", "планета", "вакуум", "ракета", "галактика", "бесконечность", "пустота", "полёт", "спутник", "планеты", "пространство", "луна",
        "космонавт", "небо", "чёрная", "дыра", "невесомость", "корабль", "дыра", "орбита", "метеорит", "мир", "млечный", "путь", "астрономия", "комета", "пыль", "инопланетяне", "нло",
        "астероид", "хаос", "астронавт", "солнце", "созвездие", "юпитер", "путь", "интерстеллар", "скафандр", "солнечная", "система", "фантастика", "тьма", "парсек", "галактики", "безграничность",
        "звездолёт", "гравитация", "душа", "бог", "мкс", "туманность", "простор", "космический", "корабль", "космонавтика", "астероиды", "шаттл", "королёв", "наука", "материя", "атмосфера", "земля",
        "гостиница", "океан", "человек", "неизвестность", "ночь", "жизнь", "энергия", "марс", "воздух", "венера", "покорение", "будущее", "бездна", "время", "метеор", "холод", "телескоп", "открытие",
        "спейс", "циолковский", "бескрайность", "небесное", "тело", "мрак", "вечность", "ссср", "лучи", "красота", "стратосфера", "мечты", "космонавты", "звёздное", "небо", "леонов", "тишина", "разум",
        "иллюминатор", "луноход", "чернота", "байконур", "порядок", "космизм", "глубина", "осмос", "любовь", "физика", "предчувствие", "луч", "мироздание", "космодром", "звёздная", "пыль", "даль", "ракеты",
        "неизведанное", "звездочёт", "хаббл", "астрофизика", "спутники", "необъятность", "мечта", "станция", "путешествие", "микрокосм", "улёт"],
    боль: ["рана", "страдание", "слёзы", "жизнь", "укол", "удар", "голова", "зуб", "страх", "кровь", "любовь", "синяк", "перелом", "болезнь", "чувство",
        "смерть", "страдания", "утрата", "сердце", "лекарство", "травма", "мучение", "зубы", "грусть", "врач", "сила", "больница", "печаль", "роды", "плач", "живот", "мука",
        "лечение", "ужас", "крик", "стон", "ушиб", "горе", "обида", "таблетка", "разлука", "доктор", "мигрень", "таблетки", "укус", "ненависть", "мазохизм", "падение", "тоска",
        "потеря", "терпение", "мышцы", "аспирин", "радость", "ад", "сустав", "шрам", "одиночество", "садизм", "мазохист", "нурофен", "порез", "ранение", "тело", "наказание", "горло",
        "ожог", "спина", "анальгин", "стоматолог", "душа", "секс", "кашель", "насилие", "фантом", "счастье", "удовольствие", "война", "предательство", "игла", "разочарование", "отит",
        "чувства", "слабость", "беда", "садист", "геморрой", "острота", "раны", "наслаждение", "школа", "опыт", "пытка", "жалость", "тяжесть", "увечье", "нерв", "унижение", "мучения",
        "обезболивающее", "нога", "отчаяние", "нарыв", "анестезия", "жало", "слеза", "операция", "гнев", "ссадина", "ангина", "правда", "измена", "кариес", "испытание", "недомогание",
        "муки", "анальгетик", "злость", "судороги", "ощущение", "ток", "нервы", "температура", "депрессия", "приступ", "лекарства", "дантист", "ревматизм", "бдсм", "нож", "пытки", "ссора",
        "хворь", "язва", "ломка", "иголка", "водка", "переживание", "расставание", "невыносимость", "соль", "лезвие", "болячка", "наркотик", "горечь", "фантомная", "боль", "стресс", "старость",
        "гематома", "ранка", "страсть", "хирург", "детство", "причина", "резь", "жжение", "огонь", "жар", "сочувствие", "месячные", "время", "угол", "раздражение", "нежность", "утро", "йод", "заноза",
        "апатия", "парацетамол", "мазь", "семья", "урон", "морфий", "воспаление", "гримаса", "колено", "зубной", "врач", "сожаление", "тлен", "наркоз", "злоба", "опасность", "молоток", "боязнь", "утешение",
        "сверло", "разрыв", "осколки", "оргазм", "жажда", "биология", "грех", "пиво", "кайф", "тьма", "мать", "психосоматика", "уныние", "наркотики", "спазмы", "кошмар", "медицина", "острое", "дискомфорт",
        "садо-мазо", "гипс", "скальпель", "акушер", "ревность", "раскаяние", "лоб", "опиум", "ринг", "казнь", "изжога", "отёк", "противность", "симптом", "трах", "татуировка", "садомазохизм", "беременность",
        "родоразрешение", "антибиотик", "опухоль", "айболит", "несчастье", "синдром", "шприц", "рождение", "мозоль", "похмелье", "шок", "ложь", "сигнал", "шипы", "мышеловка"
    ],
    музыка: ["песня", "рок", "звук", "гитара", "ноты", "искусство", "инструмент", "ритм", "слух", "гармония", "наушники", "мелодия", "нота", "творчество", "арфа", "джаз", "танцы", "звуки",
        "плеер", "пианино", "композитор", "рояль", "такт", "классика", "опера", "скрипичный", "ключ", "аккорд", "пение", "концерт", "громкость", "танец", "попса", "рок-н-ролл", "звучание", "вивальди",
        "оркестр", "радость", "шум", "барабан", "певец", "скрипка", "фортепиано", "колонки", "бах", "муза", "виолончель", "уши", "пластинка", "радио", "настроение", "металл", "лад", "релакс", "сольфеджио",
        "жанр", "колонка", "удовольствие", "композиция", "моцарт", "чайковский", "симфония", "кино", "орган", "поп", "дискотека", "любовь", "труба", "мелодичность", "голос", "консерватория", "струны",
        "флейта", "гамма", "диджей", "бетховен", "песни", "меломан", "чудо", "эстрада", "диско", "акустика", "дождь", "наушник", "ключ", "тишина", "дирижёр", "хит", "живопись",
        "терменвокс", "аккомпанемент", "кантри", "проигрыватель", "партитура", "свирель", "шопен", "айтюнс", "битлз", "динамик", "душа", "группа", "блюз", "клуб", "стихи", "мотив",
        "вдохновение", "счастье", "транс", "наслаждение", "техно", "баян", "дунаевский", "слова", "трек", "гусли", "диск", "аккордеон", "эмоции", "инструменты", "ухо", "вибрации",
        "синтезатор", "соната", "дебюсси", "шансон", "дудочка", "хиппи", "квартет", "шкатулка", "лира", "хип-хоп", "негры", "тональность", "поэзия", "праздник", "пароход", "бубен",
        "клавиши", "урок", "хор", "импровизация", "марш", "бас-гитара", "вокал", "эмбиент", "римский-корсаков", "радиола", "стиль", "хип", "свет", "зацепин", "море", "вибрация",
        "музы", "панк", "океан", "фальшь", "клип", "грусть", "спокойствие", "время", "вперёд", "кларнет", "айпод", "цой", "йелло", "расслабление", "сладкоголосие", "космос",
        "балалайка", "культура", "рэп", "мираж", "математика", "грохот", "сфер", "регги", "минор", "аудиозапись", "темп", "эхо", "хаус", "бит", "бородин", "фон", "филармония",
        "страсть", "туса", "резонанс", "сирены", "бульканье", "музон", "меланхолия", "небо", "пикник", "гимн", "хобби", "пляски", "бард", "торжество", "воздух", "песенка",
        "стравинский", "свист", "маэстро", "звёзды", "гершвин", "ария", "трубач", "репетиция", "дискач", "утренник", "наркотики", "эло", "умиротворение", "адажио", "аэробика",
        "караоке", "рокетс", "девяностые", "динамика", "рамштайн"],
    игра: ["жизнь", "шахматы", "прятки", "дети", "развлечение", "детство", "театр", "покер", "ассоциация", "футбол", "азарт", "ассоциации", "кости", "домино", "мяч", "актёр", "слова", "шашки",
        "забава", "мафия", "правила", "классики", "карты", "нарды", "разум", "игрушка", "компьютер", "что", "где", "когда", "твистер", "любовь", "хоккей", "монополия", "ребёнок", "казино", "рулетка",
        "волейбол", "го", "выигрыш", "кубики", "роль", "салки", "веселье", "радость", "престол", "квест", "актёры", "смех", "пятнашки", "счёт", "догонялки", "победа", "приставка", "команда", "спорт",
        "война", "обман", "увлечение", "двор", "теннис", "стратегия", "соревнование", "уровень", "бисер", "дота", "секс", "фишка", "бутылочка", "казаки-разбойники", "лото", "крестики-нолики", "конец",
        "персонаж", "мячик", "гол", "счастье", "гитара", "лего", "удовольствие", "поле", "раздевание", "мир", "бадминтон", "победитель", "симуляция", "политика", "преферанс", "кино", "поддавки",
        "виртуальность", "фишки", "фильм", "детский", "сад", "варкрафт", "компания", "фальшь", "притворство", "свечи", "реальность", "слово", "приз", "ход", "танки", "шалость", "проигрыш", "икра",
        "геймеры", "сцена", "правило", "потеха", "пила", "интерес", "царь", "горы", "очки", "шарада", "карта", "флирт", "смерть", "джойстик", "зависимость", "тетрис", "дозор", "кегли", "перемена", "лапта",
        "дартс", "кость", "риск", "кубик", "бильярд", "деньги", "отдых", "фортуна", "зарница", "ребус", "времяпрепровождение", "воображение", "поле", "чудес", "пьеса", "лабиринт", "стадион", "жмурки",
        "задрот", "опыт", "подземелье", "счастливый", "фермер", "игрушки", "тактика", "баскетбол", "интеллект", "баловство", "крокодил", "активность", "автомат", "розыгрыш", "снежки", "очко", "консоль",
        "страсть", "олимпиада", "творчество", "лила", "плейстейшн", "качели", "конструктор", "карточки", "шляпа", "друзья", "пазл", "телефон", "кошка", "дум", "участие", "пианино", "ничья", "симулятор",
        "хороводы", "машинки", "морской", "бой", "вовлечённость"]
};

// Анимация в главном меню

btn.addEventListener('mouseenter', function () {
    img.forEach(img => img.classList.toggle('hidden'));
    let tik = 1;
    const animDark = setInterval(function () {
        img.forEach(img => img.style.filter = `brightness(${tik = tik - 0.1})`);
        if (tik <= 0) clearInterval(animDark);
    }, 50);
    headH1.textContent = "Висельник";
});

btn.addEventListener('mouseleave', function () {
    img.forEach(img => img.classList.toggle('hidden'));
    let tik = 0;
    const animLight = setInterval(function () {
        img.forEach(img => img.style.filter = `brightness(${tik = tik + 0.1})`);
        if (tik >= 1) clearInterval(animLight);
    }, 50);
    startSection.classList.contains('hidden') ?
        headH1.textContent = 'Висельник' : headH1.textContent = 'В_сельн_к';
});

btn.addEventListener('click', function (e) {
    e.preventDefault();
    startSection.classList.add('hidden');
    categoriesSection.classList.remove('hidden');
});

// шифрование слов
const Word_ord = function (word) {
    const massLetter = word.split('');
    const firstLetter = massLetter[0];
    const lastLetter = massLetter[massLetter.length - 1];
    massLetter.forEach((letter, index) => {
        if (!(letter === firstLetter || letter === lastLetter || letter === "-")) massLetter[index] = '_';
    });
    return massLetter.join('');
};

// Выбор категорий и слов
let currentCategory;
let correctWord;

const randomWord = function (currentCategory) {
    currentCategory = currentCategory.toLowerCase();
    const massCategory = categories[`${currentCategory}`];
    const randomNumber = Math.floor((Math.random() * massCategory.length));
    correctWord = categories[`${currentCategory}`][randomNumber];
    return massCategory[randomNumber].toLowerCase();

};

// Функция для определения букв которые уже соддержутся в слове
const letterIncludes = function () {
    let oldWord = currentWord.textContent.toLowerCase();

    [...Letters.querySelectorAll('.letter')].forEach(letter => {
        if (oldWord.includes(letter.textContent.toLowerCase())) {
            letter.style.borderColor = "green";
            letter.style.color = "green";
            letter.style.pointerEvents = 'none';
        }
    });
};



categoriesLinks.addEventListener('click', function (e) {
    e.preventDefault();
    if (e.target.classList.contains('categories-link')) {
        categoriesSection.classList.add('hidden');
        playSection.classList.remove('hidden');

        currentCategory = e.target.textContent;
        currentWord.textContent = Word_ord(randomWord(currentCategory));
        letterIncludes();
    }
});

// Ошибки и правильные ответы
let error = [];
const correct = [];


// Игровой процесс

Letters.addEventListener('click', function (e) {
    e.preventDefault();
    // if (!correctWord) correctWord = categories[`${currentCategory.toLowerCase()}Cor`][0];

    if (!(e.target.textContent.length > 1) &&
        correctWord.includes(e.target.textContent.toLowerCase())) {
        let oldWord = currentWord.textContent.split('');

        oldWord.forEach((_, index) => {
            if (correctWord[index] === e.target.textContent.toLowerCase())
                oldWord[index] = e.target.textContent;
        });
        currentWord.textContent = oldWord.join('');
        e.target.style.borderColor = "green";
        e.target.style.color = "green";
        e.target.style.pointerEvents = 'none';
        correct.push(e.target);
    }
    if (!(e.target.textContent.length > 1) &&
        !correctWord.includes(e.target.textContent.toLowerCase())) {
        e.target.style.borderColor = "red";
        e.target.style.color = "red";
        e.target.style.pointerEvents = 'none';
        error.push(e.target);
    }

    if (error.length === 2) {
        [...AllImage].find(el => !el.classList.contains('hidden')).classList.add('hidden');
        [...AllImage].find(el => el.dataset.number === "2").classList.remove('hidden');
    }
    if (error.length === 3) {
        [...AllImage].find(el => !el.classList.contains('hidden')).classList.add('hidden');
        [...AllImage].find(el => el.dataset.number === "3").classList.remove('hidden');
        currentWord.textContent = correctWord;
        changeWord();
    }

    correctWord.toLowerCase() === currentWord.textContent.toLowerCase() ? changeWord() : '';
});

// Смена слова
const changeWord = function () {
    [...Letters.querySelectorAll('.letter')].map(el => el.style.pointerEvents = 'none');
    // setTimeout(function () {
    //     error = [];
    //     [...Letters.querySelectorAll('.letter')].map(el => el.style = '');
    //     [...AllImage].forEach(el => {
    //         el.dataset.number ? el.classList.add('hidden') : el.classList.remove('hidden');
    //     });
    //     currentWord.textContent = randomWord(currentCategory);
    // }, 5000);

    controlPlay.style.display = "flex";
};

// Еще раз
againBtn.addEventListener('click', function (e) {
    error = [];
    e.preventDefault();
    controlPlay.style.display = "";
    [...Letters.querySelectorAll('.letter')].map(el => el.style = '');
    [...AllImage].forEach(el => {
        el.dataset.number ? el.classList.add('hidden') : el.classList.remove('hidden');
    });
    currentWord.textContent = Word_ord(randomWord(currentCategory));
    letterIncludes();
});

// Категорий
categoriesBtn.addEventListener('click', function (e) {
    e.preventDefault();
    controlPlay.style.display = "";
    categoriesSection.classList.remove('hidden');
    playSection.classList.add('hidden');
    error = [];
    [...Letters.querySelectorAll('.letter')].map(el => el.style = '');
    [...AllImage].forEach(el => {
        el.dataset.number ? el.classList.add('hidden') : el.classList.remove('hidden');
    });
});




// Отладка


// ['mouseenter', 'mouseleave'].forEach(eventBtn => {
//     btn.addEventListener(eventBtn, function () {
//         img.forEach(img => img.classList.toggle('img-end--hidden'));
//         eventBtn === 'mouseenter' ? document.querySelector('h1').textContent = "Висельник" : document.querySelector('h1').textContent = "В_сельн_к";


//         let tik;
//         eventBtn === 'mouseenter' ? tik = 1 : tik = 0;
//         const animLight = setInterval(function () {
//             img.forEach(img => img.style.filter = `brightness(${eventBtn === 'mouseenter' ? tik = tik + 0.1 : tik = tik - 0.1})`);

//         }, 50);

//     });
// });

